{
  "personal_info": {
    "name": "IVAN ANDRES ZUÑIGA ROMO",
    "title": [
      "Líder en Transformación Digital",
      "Full-Stack Developer con Enfoque en IA",
      "Estratega de Innovación Tecnológica"
    ],
    "contact": {
      "phone": "+57 322 913 2643",
      "email": "ivanzuiga1996@gmail.com",
      "address": "Calle 18 No. 58-60 Pasto- Nariño",
      "socials": {
        "linkedin": "https://www.linkedin.com/in/iazr96/",
        "github": "https://github.com/andreszuniga96",
        "instagram": ""
      }
    },
    "languages": [
      {
        "language": "Español",
        "level": "Nativo"
      },
      {
        "language": "Inglés",
        "level": "B1"
      }
    ]
  },
  "summaries": {
  "who_am_i": "Soy un estratega y desarrollador que convierte desafíos de negocio en soluciones tecnológicas eficientes. Mi especialidad es fusionar el desarrollo Full-Stack con la inteligencia artificial para crear aplicaciones que automaticen procesos, potencien el crecimiento y le den una ventaja competitiva a tu proyecto.",
  "professional_profile": "Ingeniero de Sistemas y telecomunicaciones, con Maestrías en Administración e Inteligencia Artificial (en curso) y Especialización en Alta Gerencia. Mi carrera se define por la intersección de la tecnología y la estrategia. Como desarrollador Full-Stack, arquitecto soluciones integrales en la nube y experto en ciberseguridad. Como estratega, he liderado proyectos de alto impacto, desde la dirección técnica de procesos electorales hasta la asesoría en planes de desarrollo municipal, aplicando siempre la tecnología como una herramienta para impulsar la innovación y el desarrollo sostenible."
  },
  "services": [
    {
      "title": "Desarrollo de Aplicaciones Web y Móviles a Medida",
      "icon": "FaCode",
      "description": "Transformo tu visión en una solución digital robusta y escalable. Me especializo en la construcción de aplicaciones completas (Full-Stack), desde el diseño de una interfaz de usuario atractiva e intuitiva hasta la creación de un back-end potente y seguro.",
      "skills_and_technologies": [ "Desarrollo Full-Stack", "Diseño de UI/UX", "Bases de Datos (SQL/NoSQL)", "Desarrollo de APIs", "Arquitectura en la Nube" ]
    },
    {
      "title": "Consultoría en IA y Transformación Digital",
      "icon": "AiOutlineRobot",
      "description": "Ayudo a las empresas a ser más inteligentes y eficientes. Implemento soluciones de Inteligencia Artificial para automatizar procesos, analizar datos y crear experiencias de usuario personalizadas (como chatbots o sistemas de recomendación).",
      "skills_and_technologies": [ "Liderazgo en Transformación Digital", "Inteligencia Artificial", "Análisis de Datos", "Machine Learning" ]
    },
    {
      "title": "Estrategia y Gestión de Proyectos Tecnológicos",
      "icon": "FaProjectDiagram",
      "description": "Lidero proyectos tecnológicos complejos desde la concepción hasta el éxito. Mi experiencia como Director Técnico y Asesor en Planes de Desarrollo me permite gestionar equipos, definir hojas de ruta claras y asegurar entregas de alta calidad utilizando metodologías ágiles.",
      "skills_and_technologies": [ "Dirección de Proyectos", "Metodologías Ágiles (SCRUM)", "Planificación Estratégica", "Gestión de Equipos", "MGA" ]
    },
    {
      "title": "Análisis y Visualización de Datos (Business Intelligence)",
      "icon": "FaChartBar",
      "description": "Convierto tus datos en decisiones estratégicas. Utilizando herramientas como Microsoft Power BI, diseño y construyo dashboards interactivos que te permiten entender el comportamiento de tus clientes, optimizar ventas y visualizar el rendimiento de tu negocio.",
      "skills_and_technologies": [ "Microsoft Power BI", "Análisis de Datos", "Visualización de Datos", "SQL" ]
    },
    {
      "title": "Seguridad Informática y Arquitectura Cloud",
      "icon": "MdSecurity",
      "description": "Diseño e implemento infraestructuras tecnológicas seguras y escalables. Como Analista de Seguridad certificado por Google, me enfoco en proteger tus activos digitales, gestionar vulnerabilidades y asegurar la integridad de tu información.",
      "skills_and_technologies": [ "Ciberseguridad", "Arquitectura en la Nube", "Análisis de Vulnerabilidades", "Gestión de Riesgos" ]
    }
  ],
  "skills": {
    "soft": [ "Liderazgo", "Trabajo en equipo", "Orientado a soluciones", "Proactividad", "Visión estratégica", "Desarrollo sostenible", "Adaptabilidad", "Comunicación efectiva" ],
    "technical": [ "Python", "Inteligencia Artificial", "React", "Node.js", "SQL", "PostgreSQL", "MongoDB", "Power BI", "Ciberseguridad", "Blockchain", "Docker", "Linux", "AWS", "Google Cloud", "MGA", "Planes de Desarrollo" ]
  },
  "experience": [
    {
      "position": "Mentor de bootcamps (IA, Análisis de Datos, Full Stack, etc.)",
      "company": "Talento TECH - Regiones 1, 2 y 3",
      "dates": "Junio 2024 - Septiembre 2025",
      "responsibilities": [
        "Diseñar e impartir más de 200 horas de contenido sobre desarrollo web, ciencia de datos e IA a +100 estudiantes.",
        "Crear y evaluar proyectos prácticos y hackathones para solidificar el aprendizaje y fomentar el trabajo en equipo.",
        "Brindar mentoría personalizada, resolviendo dudas técnicas y guiando el desarrollo profesional de los participantes.",
        "Generar informes de seguimiento sobre el progreso de los estudiantes y el cumplimiento de los objetivos del bootcamp."
      ]
    },
    {
      "position": "Asesor Plan de Desarrollo del Municipio de Pasto",
      "company": "Agencia de Desarrollo Local - ADEL",
      "dates": "Febrero 2024 - Julio 2024",
      "responsibilities": [
        "Coordinar y liderar las mesas de trabajo técnicas para la formulación del plan, integrando la participación ciudadana con los requerimientos institucionales.",
        "Gestionar y sistematizar la información estratégica del municipio, utilizando la Metodología General Ajustada (MGA) para la estructuración de proyectos.",
        "Actuar como enlace principal entre las secretarías municipales, entidades externas y la comunidad para garantizar la cohesión y el avance del plan.",
        "Elaborar y presentar informes de avance mensuales a la alta dirección, detallando hitos, riesgos y resultados."
      ]
    },
    {
      "position": "Director Técnico Proceso Electoral PRECONTEO",
      "company": "Thomas Processing & System - Nariño",
      "dates": "Agosto 2023 - Noviembre 2023",
      "responsibilities": [
        "Diseñar y ejecutar el plan técnico operativo para el centro de procesamiento de datos, garantizando una disponibilidad del 100% durante la jornada electoral.",
        "Liderar y capacitar al equipo de ingenieros y técnicos responsables de la infraestructura de red, software y hardware.",
        "Implementar y auditar los protocolos de ciberseguridad para proteger la integridad y la transparencia de la transmisión de datos electorales.",
        "Coordinar con las autoridades electorales (Registraduría) y misiones de observación para validar la correcta ejecución de los procedimientos técnicos."
      ]
    },
    {
      "position": "Desarrollador Full Stack",
      "company": "Dozurcol Pasto",
      "dates": "Agosto 2019 - Diciembre 2022",
      "responsibilities": [
        "Desarrollar y mantener aplicaciones web completas, gestionando el ciclo de vida desde el front-end (React) hasta el back-end (Node.js, Python).",
        "Diseñar, modelar y administrar bases de datos relacionales (PostgreSQL) y NoSQL (MongoDB), enfocándose en la optimización y seguridad.",
        "Construir y documentar APIs RESTful robustas para la integración de servicios y la comunicación entre el cliente y el servidor.",
        "Implementar prácticas de CI/CD y control de versiones con Git para asegurar la calidad y la agilidad en el despliegue de software."
      ]
    },
    {
      "position": "Docente Técnico",
      "company": "INSTITUTO TÉCNICO SISTEMATIZADO DE NARIÑO",
      "dates": "Enero 2021 - Diciembre 2022",
      "responsibilities": [
          "Impartir formación técnica en programas de Inteligencia Artificial, Análisis de Datos, Blockchain, y Programación.",
          "Diseñar y actualizar el material de estudio, incluyendo presentaciones, talleres prácticos y proyectos finales.",
          "Evaluar el rendimiento de los estudiantes a través de métodos prácticos y teóricos, ofreciendo retroalimentación constructiva.",
          "Colaborar en la mejora continua de los planes de estudio para alinearlos con las demandas del sector tecnológico."
      ]
    },
    {
      "position": "Analista de Seguridad de la Información",
      "company": "Comercializadora Dozurcol",
      "dates": "Julio 2016 - Julio 2019",
      "responsibilities": [
          "Monitorear y analizar los registros de seguridad de la red para identificar, investigar y documentar posibles amenazas y vulnerabilidades.",
          "Diseñar y proponer medidas de mitigación y planes de respuesta a incidentes para minimizar el impacto de brechas de seguridad.",
          "Implementar y gestionar soluciones de seguridad, incluyendo firewalls, sistemas de detección de intrusos y políticas de control de acceso.",
          "Desarrollar y impartir material educativo y capacitaciones para el personal sobre mejores prácticas de ciberseguridad."
      ]
    }
  ],
  "education": [
    {
      "degree": "Master en Inteligencia Artificial",
      "institution": "Universidad a Distancia de Madrid (UDIMA)",
      "dates": "2025-2026"
    },
    {
      "degree": "Google Cybersecurity (Certificado profesional)",
      "institution": "Google",
      "dates": "2025"
    },
    {
      "degree": "Magister en Administración",
      "institution": "Universidad Mariana Sede Pasto",
      "dates": "2021-2023"
    },
    {
      "degree": "Microsoft Power BI Data Analyst (Certificado profesional)",
      "institution": "Microsoft",
      "dates": "2025"
    },
    {
      "degree": "Especialista en Alta Gerencia",
      "institution": "Universidad Mariana Sede Pasto",
      "dates": "2018-2019"
    },
    {
      "degree": "Microsoft Front-End Developer (Certificado profesional)",
      "institution": "Microsoft",
      "dates": "2025"
    },
    {
      "degree": "Ingenieria de sistemas y telecomunicaciones",
      "institution": "Universidad Sergio Arboleda Sede Bogota",
      "dates": "2012-2017"
    },
    {
      "degree": "SAP Technology Consultant (Certificado profesional)",
      "institution": "SAP",
      "dates": "2025"
    }
  ]
}